{
    "The requested resource could not be found.": "Die angefragte Ressource konnte nicht gefunden werden.",
    "There was an error with your request.": "Es gab einen Fehler bei Ihrer Anfrage.",
    "The server encountered an internal error and could not complete your request.": "Es ist ein interner Fehler aufgetreten. Ihre Anfrage konnte nicht abgeschlossen werden.",
    "Logged in as": "Angemeldet als",
    "Log in": "Anmelden",
    "Register": "Registrieren",
    "Log out": "Abmelden",
    "Username": "Benutzername",
    "Password": "Passwort",
    "Password (repeat)": "Passwort (wiederholen)",
    "Email": "E-Mail",
    "Don't have an account yet?": "Noch keinen Account?",
    "Click here to register.": "Klicken Sie hier, um sich zu registrieren.",
    "Forgot password?": "Passwort vergessen?",
    "Please enter your account's verified email address below. You will then receive an email with instructions about how to recover your password.": "Bitte geben Sie unten die bestätigte E-Mail-Adresse Ihres Accounts ein. Sie erhalten dann eine E-Mail mit Anweisungen zur Wiederherstellung Ihres Passworts.",
    "Send instructions": "Anweisungen senden",
    "Log in instead?": "Stattdessen anmelden?",
    "Please enter your new password.": "Bitte geben Sie Ihr neues Passwort ein.",
    "At least 8 characters": "Mindestens 8 Zeichen",
    "Uppercase letters": "Großbuchstaben",
    "Lowercase letters": "Kleinbuchstaben",
    "Numbers or special characters": "Zahlen oder Sonderzeichen",
    "Change password": "Passwort ändern",
    "Already have an account?": "Haben Sie bereits einen Account?",
    "Click here to log in.": "Hier klicken, um sich anzumelden.",
    "Upon registration, you will receive an email with a link. Please open that link to verify your email address and to get access to your account.": "Nach der Registrierung erhalten Sie eine E-Mail mit einem Link. Bitte öffnen Sie diesen Link, um Ihre E-Mail-Adresse zu bestätigen und Zugang zu Ihrem Account zu erhalten.",
    "Please log in with your account's credentials.": "Bitte melden Sie sich mit den Anmeldedaten Ihres Accounts an.",
    "Before logging in, please verify your account's email address.": "Bitte bestätigen Sie vor dem Anmelden die E-Mail-Adresse Ihres Accounts.",
    "An account with these credentials could not be found. Please check for spelling errors and try again.": "Ein Account mit diesen Anmeldedaten konnte nicht gefunden werden. Bitte überprüfen Sie Ihre Eingaben auf Tippfehler und versuchen Sie es erneut.",
    "Please enter your account's verified email address.": "Bitte geben Sie die bestätigte E-Mail-Adresse Ihres Accounts ein.",
    "The specified email address is invalid. Please check for spelling errors and try again.": "Die angegebene E-Mail-Adresse ist ungültig. Bitte überprüfen Sie Ihre Eingaben auf Tippfehler und versuchen Sie es erneut.",
    "An account with this email could not be found. Please check for spelling errors and try again.": "Ein Account mit dieser E-Mail-Adresse konnte nicht gefunden werden. Bitte überprüfen Sie Ihre Eingaben auf Tippfehler und versuchen Sie es erneut.",
    "Password recovery": "Passwort wiederherstellen",
    "You have requested to recover your password for your $$appName$$ account.": "Sie haben die Wiederherstellung Ihres Passworts für Ihren $$appName$$-Account angefordert.",
    "To set a new password, please open the following link:": "Um ein neues Passwort festzulegen, öffnen Sie bitte den folgenden Link:",
    "This link is valid for 15 minutes.": "Dieser Link ist 15 Minuten gültig.",
    "If you haven't requested a password recovery for your $$appName$$ account, you can ignore this email.": "Wenn Sie keine Passwortwiederherstellung für Ihren $$appName$$-Account angefordert haben, können Sie diese E-Mail ignorieren.",
    "You have requested a password recovery.": "Sie haben eine Passwortwiederherstellung angefordert.",
    "Shortly, you will receive an email with a link. Please open that link to set a new password.": "In Kürze erhalten Sie eine E-Mail mit einem Link. Bitte öffnen Sie diesen Link, um ein neues Passwort festzulegen.",
    "An error has occurred. Please try again later.": "Ein Fehler ist aufgetreten. Bitte versuchen Sie es später erneut.",
    "The URL has already been invalidated. Please log in or request a new password recovery email.": "Die URL ist bereits ungültig. Bitte melden Sie sich an oder fordern Sie eine neue E-Mail zur Passwortwiederherstellung an.",
    "Please fill out all the required fields.": "Bitte füllen Sie alle erforderlichen Felder aus.",
    "The specified passwords do not match. Please check for spelling errors and try again.": "Die angegebenen Passwörter stimmen nicht überein. Bitte überprüfen Sie Ihre Eingaben auf Tippfehler und versuchen Sie es erneut.",
    "Your password has been changed.": "Ihr Passwort wurde geändert.",
    "You can now log in to your account.": "Sie können sich jetzt mit Ihrem Account anmelden.",
    "The specified username is invalid. Please follow the required username scheme.": "Der angegebene Benutzername ist ungültig. Bitte folgen Sie dem erforderlichen Benutzernamensschema.",
    "An account with this username already exists. Please choose another one.": "Ein Account mit diesem Benutzernamen existiert bereits. Bitte wählen Sie einen anderen.",
    "An account with this email already exists. If that is your account, please log in instead.": "Ein Account mit dieser E-Mail existiert bereits. Wenn dies Ihr Account ist, melden Sie sich bitte stattdessen an.",
    "The specified password doesn't fulfill the password requirements. Please choose a safer password.": "Das angegebene Passwort erfüllt die Passwortanforderungen nicht. Bitte wählen Sie ein sichereres Passwort.",
    "Verify your email address": "Bestätigen Sie Ihre E-Mail-Adresse",
    "A new $$appName$$ account has been registered with this email address.": "Ein neuer $$appName$$-Account wurde mit dieser E-Mail-Adresse registriert.",
    "To verify your email address and to complete the registration process, please open the following link:": "Um Ihre E-Mail-Adresse zu bestätigen und den Registrierungsprozess abzuschließen, öffnen Sie bitte den folgenden Link:",
    "If you haven't registered an account at $$appName$$, you can ignore this email.": "Wenn Sie keinen Account bei $$appName$$ registriert haben, können Sie diese E-Mail ignorieren.",
    "Your account has been registered.": "Ihr Account wurde registriert.",
    "Please open the verification link that has been sent to you per email. You can log in to your account once your email address has been verified.": "Bitte öffnen Sie den Bestätigungslink, der Ihnen per E-Mail gesendet wurde. Sie können sich mit Ihrem Account anmelden, sobald Ihre E-Mail-Adresse bestätigt wurde.",
    "Your email address has been verified. You can now log in to your account.": "Ihre E-Mail-Adresse wurde bestätigt. Sie können sich jetzt mit Ihrem Account anmelden.",
    "Version:": "Version:",

    "No users were registered yet. An administrator account has been created.": "Es wurden noch keine Benutzer registriert. Ein Administrator-Account wurde erstellt.",
    "Registration is currently disabled. Please contact an administrator for further information.": "Das Registrieren ist derzeit nicht möglich. Bitte wenden Sie sich für weitere Informationen an einen Administrator.",

    "Dashboard": "Dashboard",
    "Account settings": "Accounteinstellungen",
    "Manage your personal information, security settings, and account preferences.": "Verwalten Sie ihre persönlichen Informationen, Sicherheitseinstellungen und Accountpräferenzen.",
    "Update your account password.": "Ändern Sie Ihr Passwort.",
    "Please enter your current password and confirm your new one.": "Bitte geben Sie Ihr aktuelles Passwort ein und bestätigen Sie Ihr neues.",
    "Current password": "Aktuelles Passwort",
    "New password": "Neues Passwort",
    "New password (repeat)": "Neues Passwort (wiederholen)",
    "The password does not meet the requirements.": "Das Passwort erfüllt nicht die Sicherheitsanforderungen.",
    "The passwords do not match.": "Die Passwörter stimmen nicht überein.",
    "The current password is incorrect.": "Das aktuelle Paswort ist falsch.",
    "Your password has been updated.": "Ihr Passwort wurde geändert.",
    "Personal API key": "Persönlicher API-Schlüssel",
    "Manage your personal API key.": "Verwalten Sie Ihren persönlichen API-Schlüssel.",
    "Personal UID": "Persönliche UID",

    "Animation management": "Animationen verwalten",

    "Animations": "Animationen",
    "Create or edit your own custom animations.": "Erstellen oder bearbeiten Sie Ihre Animationen.",
    "Create animation": "Animation erstellen",
    "Edit animation $$name$$": "Animation „$$name$$” bearbeiten",
    "Delete animation": "Animation löschen",
    "Do you really want to delete this animation?": "Möchten Sie diese Animation wirklich löschen?",
    "Animation name": "Name",
    "Animation type": "Art",
    "Duration per color": "Dauer pro Farbe",
    "Color": "Farbe",
    "Colors": "Farben",
    "Add color": "Farbe hinzufügen",
    "The animation that should be edited does not exist.": "Die zu bearbeitende Animation existiert nicht.",
    "The animation that should be deleted does not exist.": "Die zu löschende Animation existiert nicht.",
    "The animation has been saved.": "Die Animation wurde gespeichert.",
    "The animation has been deleted.": "Die Animation wurde gelöscht.",

    "Devices": "Geräte",
    "Register new devices which should be animated.": "Registrieren Sie neue zu animierende Geräte.",
    "Create device": "Gerät erstellen",
    "Edit device $$name$$": "Gerät „$$name$$” bearbeiten",
    "Delete device": "Gerät löschen",
    "Do you really want to delete this device?": "Möchten Sie dieses Gerät wirklich löschen?",
    "Device name": "Gerätename",
    "Device UID": "Geräte-UID",
    "Device API key": "Geräte-API-Schlüssel",
    "The device that should be edited does not exist.": "Das zu bearbeitende Gerät existiert nicht.",
    "The device that should be deleted does not exist.": "Das zu löschende Gerät existiert nicht.",
    "The device has been saved.": "Das Gerät wurde gespeichert.",
    "The device has been deleted.": "Das Gerät wurde gelöscht.",

    "Control panel": "Kontrollpanel",
    "Switch the animations for your devices.": "Wechseln Sie die Animationen für Ihre Geräte.",
    "$$name$$": "„$$name$$”",
    "Animation": "Animation",
    "Select an animation": "Animation auswählen",
    "Power": "Eingeschaltet",
    "The device that should be controlled does not exist.": "Das zu kontrollierende Gerät existiert nicht.",
    "The selected animation does not exist.": "Die ausgewählte Animation existiert nicht.",

    "System administration": "Systemverwaltung",

    "User management": "Benutzerverwaltung",
    "Manage user accounts.": "Verwalten Sie Benutzeraccounts.",
    "Create user": "Account erstellen",
    "Edit user $$name$$": "Account „$$name$$” bearbeiten",
    "Delete user": "Account löschen",
    "Do you really want to delete this user?": "Möchten Sie diesen Account wirklich löschen?",
    "Email verified": "Email bestätigt",
    "Administrator": "Administrator",
    "Yes": "Ja",
    "No": "Nein",
    "leave empty to keep old one": "leer lassen um das alte beizubehalten",
    "The user that should be edited does not exist.": "Der zu bearbeitende Account existiert nicht.",
    "The user that should be deleted does not exist.": "Der zu löschende Account existiert nicht.",
    "The user has been saved.": "Der Account wurde gespeichert.",
    "The user has been deleted.": "Der Account wurde gelöscht.",
    "System settings": "Systemeinstellungen",
    "Configure the system to your needs.": "Konfigurieren Sie das System nach Ihren Wünschen.",
    "Registration enabled": "Registrierung aktiviert",
    "WebSocket server host": "WebSocket-Server-Host",
    "WebSocket server channel": "WebSocket-Server-Kanal",
    "WebSocket server token": "WebSocket-Server-Token",
    "The WebSocket channel has been created.": "Der WebSocket-Kanal wurde erstellt.",
    "Failed to create the WebSocket channel.": "Der WebSocket-Kanal konnte nicht erstellt werden.",
    "The system settings have been saved.": "Die Systemeinstellungen wurden gespeichert.",

    "Search...": "Suchen...",
    "Loading...": "Wird geladen...",
    "No entries": "Keine Einträge vorhanden",
    "Back": "Zurück",
    "Next": "Weiter",
    "Save": "Speichern",
    "Delete": "Löschen",
    "Confirm": "Bestätigen",
    "Abort": "Abbrechen"
}
